Revit 2027 API
BarTerminationsData Constructor
 Creates a new instance of BarTerminationData with the default values.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BarTerminationsData(
	Document document
)
Public Sub New (
	document As Document
)
public:
BarTerminationsData(
	Document^ document
)
new :
        document : Document -> BarTerminationsData
Parameters
document Document
 The document containing the hook type ids, end treatment ids and crank type ids.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BarTerminationsData Class
Autodesk.Revit.DB.Structure Namespace